Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/deploy.po
Languages: fr

source: Deploy to Production
fr: Mise en production

source: This part of the tutorial assumes you have a server that you want to deploy your application to. It gives an overview of how to create the distribution file and install it, but won't go into specifics about what server or software to use. You can set up a new environment on your development computer to try out the instructions below, but probably shouldn't use it for hosting a real public application. See :doc:`/deploying/index` for a list of many different ways to host your application.
fr: Cette partie du tutoriel suppose que vous avez un serveur sur lequel vous souhaitez déployer votre application. Elle présente comment créer un package distribuable mais ne rentre pas dans les détails des particularités du serveur ou du logiciel à utiliser. Vous pouvez créer un environnement sur votre ordinateur de développement pour essayer les instructions ci-dessous, mais probablement pas pour installer une application publique réelle. Voyez le document :doc:`/deploying/index` pour une liste des nombreuses façons de faire tourner votre application.

source: Build and Install
fr: Installation

source: When you want to deploy your application elsewhere, you build a distribution file. The current standard for Python distribution is the *wheel* format, with the ``.whl`` extension. Make sure the wheel library is installed first:
fr: Pour mettre en production votre application ailleurs, vous devez créer un fichier distribuable. Le standard actuel pour ces fichiers distribuables en Python est le format *wheel* (extension ``.whl``). Assurez-vos d'abord d'avoir installé la librairie ``wheel``:

source: Running ``setup.py`` with Python gives you a command line tool to issue build-related commands. The ``bdist_wheel`` command will build a wheel distribution file.
fr: En exécutant ``setup.py`` avec Python, vous avez un outil en ligne de commande qui vous permet de lancer certains commandes liées à la préparation de ces fichiers distribuables. La commande ``bdist_wheel`` va construire un fichier distribuable de type wheel.

source: You can find the file in ``dist/flaskr-1.0.0-py3-none-any.whl``. The file name is the name of the project, the version, and some tags about the file can install.
fr: Vous pouvez trouver ce fichier dans ``dist/flaskr-1.0.0-py3-none-any.whl``. Le nom du fichier est composé du nom du projet, de sa version et de certaines étiquettes relatives au programme à installer.

source: Copy this file to another machine, :ref:`set up a new virtualenv <install-create-env>`, then install the file with ``pip``.
fr: Copiez ce fichier sur un autre ordinateur, créez-y un nouvel environnement virtuel (voir :ref:`set up a new virtualenv <install-create-env>`) et puis installez le fichier en utilisant ``pip``.

source: Pip will install your project along with its dependencies.
fr: Pip va installer votre projet avec ses dépendances.

source: Since this is a different machine, you need to run ``init-db`` again to create the database in the instance folder.
fr: Comme vous êtes sur un autre ordinateur, vous devez relancer ``init-db`` pour créer la base de données dans le répertoire `instance folder`.

source: When Flask detects that it's installed (not in editable mode), it uses a different directory for the instance folder. You can find it at ``venv/var/flaskr-instance`` instead.
fr: Lorsque Flask détecte qu'il est installé dans un autre mode que le mode éditable, il utilise un autre répertoire pour l'`instance folder`. Vous pouvez le trouver dans ``venv/var/flaskr-instance``.

source: Configure the Secret Key
fr: Configurez la clé secrète

source: In the beginning of the tutorial that you gave a default value for :data:`SECRET_KEY`. This should be changed to some random bytes in production. Otherwise, attackers could use the public ``'dev'`` key to modify the session cookie, or anything else that uses the secret key.
fr: Au début de ce tutoriel, vous avez choisi une valeur par défaut pour :data:`SECRET_KEY`. Cette valeur doit être changée pour contenir une séquence aléatoire de bytes lors d'une mise en production. Sinon, des pirates pourraient utiliser la clé publique ``dev`` pour modifier le cookie de session ou n'importe quelle autre donnée qui utilise la clé secrète.

source: You can use the following command to output a random secret key:
fr: Vous pouvez utiliser les commandes ci-dessous pour créer une clé secrète:

source: Create the ``config.py`` file in the instance folder, which the factory will read from if it exists. Copy the generated value into it.
fr: Créez le fichier ``config.py`` dans l'`instance folder`. C'est là que l'usine à applications ira le lire si il existe. Copiez la valeur aléatoire générée dans ce fichier.

source: ``venv/var/flaskr-instance/config.py``
fr: ``venv/var/flaskr-instance``

source: You can also set any other necessary configuration here, although ``SECRET_KEY`` is the only one needed for Flaskr.
fr: Vous pouvez aussi fixer d'autres paramètres de configuration ici, bien que ``SECRET_KEY`` soit le seul qui est vraiment nécessaire au fonctionnement de Flaskr.

source: Run with a Production Server
fr: Exécution sur un serveur en production

source: When running publicly rather than in development, you should not use the built-in development server (``flask run``). The development server is provided by Werkzeug for convenience, but is not designed to be particularly efficient, stable, or secure.
fr: Lorsque votre application tourne sur un serveur de production et non un serveur de développement, n'utilisez pas ``flask run``. Le serveur de développement est fourni par Werkzeug pour votre facilité, mais il n'est ni particulièrement stable, ni efficace si sûr.

source: Instead, use a production WSGI server. For example, to use `Waitress`_, first install it in the virtual environment:
fr: Utilisez plutôt un serveur WSGI de production. Par exemple, pour utiliser `Waitress`_, installez-le d'abord dans un environnement virtuel:

source: You need to tell Waitress about your application, but it doesn't use ``FLASK_APP`` like ``flask run`` does. You need to tell it to import and call the application factory to get an application object.
fr: You devez indiquer à Waitress la présence de votre application, mais celui-ci n'utilise pas la variable d'environnement contrairement à ``flask run``. Vous devez lui dire de l'importer et d'appeler l'usine à applications pour obtenir un objet application.

source: See :doc:`/deploying/index` for a list of many different ways to host your application. Waitress is just an example, chosen for the tutorial because it supports both Windows and Linux. There are many more WSGI servers and deployment options that you may choose for your project.
fr: Lisez le document :doc:`/deploying/index` pour voir les nombreuses façons de déployer votre application. Waitress est juste un exemple choisi pour ce tutoriel car il fonctionne sur Windows et Linux. Il y a de nombreux autres serveurs et d'autres options de déploiement que vous pouvez choisir pour votre projet.

source: Continue to :doc:`next`.
fr: Poursuivez en lisant le document :doc:`next`.
