Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/factory.po
Languages: fr

source: Application Setup
fr: Configuration de l'application

source: A Flask application is an instance of the :class:`Flask` class. Everything about the application, such as configuration and URLs, will be registered with this class.
fr: Une application Flask est une instance de la classe :class:`Flask`. Tout ce qui concerne cette application, que ce soit sa configuration ou ses URLs, sera enregistré dans cette classe.

source: The most straightforward way to create a Flask application is to create a global :class:`Flask` instance directly at the top of your code, like how the "Hello, World!" example did on the previous page. While this is simple and useful in some cases, it can cause some tricky issues as the project grows.
fr: La façon la plus simple de créer une application Flask est de créer une instance de la classe :class:`Flask` globale, directement au début de votre code, comme l'exemple "Hello, World!" sur la page précédente. Bien que cette approche soit simple et utile dans certains cas, elle peut causer des soucis lorsque le projet grandit.

source: Instead of creating a :class:`Flask` instance globally, you will create it inside a function. This function is known as the *application factory*. Any configuration, registration, and other setup the application needs will happen inside the function, then the application will be returned.
fr: Au lieu de créer un instance globale de la classe :class:`Flask`, vous allez la créer dans une fonction. Cette fonction est généralement appelée l'usine à applications (*application factory* en anglais). Toutes les opérations liées à la configuration de l'application doivent se faire dans cette fonction qui retourne l'application.

source: The Application Factory
fr: L'Usine à Applications

source: It's time to start coding! Create the ``flaskr`` directory and add the ``__init__.py`` file. The ``__init__.py`` serves double duty: it will contain the application factory, and it tells Python that the ``flaskr`` directory should be treated as a package.
fr: Il est temps de commencer à coder. Créez le répertoire ``flaskr`` et ajoutez-y le fichier ``__init__.py``. Le fichier ``__init__.py`` a deux rôles. Tout d'abord, il contient l'usine à applications. Depuis, il indique à Python que le répertoire ``flaskr`` doit être considéré comme étant un package.

source: ``create_app`` is the application factory function. You'll add to it later in the tutorial, but it already does a lot.
fr: ``create_app`` est la fonction contenant l'usine à applications. Vous la compléterez plus tard dans ce tutoriel, mais elle réalise déjà beaucoup d'opérations.

source: ``app = Flask(__name__, instance_relative_config=True)`` creates the :class:`Flask` instance.
fr: ``app = Flask(__name__, instance_relative_config=True)`` crée une instance de la classe :class:`Flask`.

source: ``__name__`` is the name of the current Python module. The app needs to know where it's located to set up some paths, and ``__name__`` is a convenient way to tell it that.
fr: ``__name__`` est le nom du module Python courant. L'application doit connaître l'endroit où est elle installée pour configurer certains chemins et ``__name__`` est une solution classique pour obtenir cette information.

source: ``instance_relative_config=True`` tells the app that configuration files are relative to the :ref:`instance folder <instance-folders>`. The instance folder is located outside the ``flaskr`` package and can hold local data that shouldn't be committed to version control, such as configuration secrets and the database file.
fr: ``instance_relative_config=True`` indique à l'application que les fichiers de configuration sont relatifs au répertoire :ref:`instance folder <instance-folders>`. Ce répertoire est localisé en dehors du package ``flaskr`` et peut contenir des données locales qui ne doivent pas être intégrées au contrôle de version, comme les secrets utilisés dans la configuration et le fichier contenant la base de données.

source: :meth:`app.config.from_mapping() <Config.from_mapping>` sets some default configuration that the app will use:
fr: :meth:`app.config.from_mapping() <Config.from_mapping>` spécifie plusieurs paramètres par défaut que l'application va utiliser:

source: :data:`SECRET_KEY` is used by Flask and extensions to keep data safe. It's set to ``'dev'`` to provide a convenient value during development, but it should be overridden with a random value when deploying.
fr: :data:`SECRET_KEY` est utilisé par Flask et des extensions pour stocker de données de façon sûre. Il est initialisé à la valeur ``'dev'`` qui est une valeur facile pendant le développement de l'application, mais doit être remplacé par une valeur aléatoire lorsque celle-ci est mise en production.

source: ``DATABASE`` is the path where the SQLite database file will be saved. It's under :attr:`app.instance_path <Flask.instance_path>`, which is the path that Flask has chosen for the instance folder. You'll learn more about the database in the next section.
fr: ``DATABASE`` est le chemin où le fichier contenant la base de données SQLite sera sauvegardé. Le préfixe de ce fichier est :attr:`app.instance_path <Flask.instance_path>`, c'est-à-dire le chemin choisi par Flask comme `instance folder`. Vous en apprendrez plus sur la base de données dans la section suivante.

source: :meth:`app.config.from_pyfile() <Config.from_pyfile>` overrides the default configuration with values taken from the ``config.py`` file in the instance folder if it exists. For example, when deploying, this can be used to set a real ``SECRET_KEY``.
fr: :meth:`app.config.from_pyfile() <Config.from_pyfile>` remplace le configuration par défaut avec des paramètres spécifiés dans le fichier ``config.py`` qui se trouve dans l'*instance folder* si celui-ci exite. Par exemple, en production, cela peut être utilisé pour fixer une ``SECRET_KEY`` vraiment secrète.

source: ``test_config`` can also be passed to the factory, and will be used instead of the instance configuration. This is so the tests you'll write later in the tutorial can be configured independently of any development values you have configured.
fr: La paramètre ``test_config`` peut aussi être passé à l'usine à applications. Dans ce cas, il sera utilisé à la place de la configuration de l'instance. Cela vous permettra de spécifier des paramètres pour vos test qui sont indépendants de ceux que vous utilisez durant le développement de l'application.

source: :func:`os.makedirs` ensures that :attr:`app.instance_path <Flask.instance_path>` exists. Flask doesn't create the instance folder automatically, but it needs to be created because your project will create the SQLite database file there.
fr: :func:`os.makedirs` vérifie que le chemin :attr:`app.instance_path <Flask.instance_path>` existe. Flask ne créer pas l'instance folder automatiquement, mais celui-ci doit être créé car votre projet cherhera à y créer le fichier contenant sa base de données SQLite.

source: :meth:`@app.route() <Flask.route>` creates a simple route so you can see the application working before getting into the rest of the tutorial. It creates a connection between the URL ``/hello`` and a function that returns a response, the string ``'Hello, World!'`` in this case.
fr: :meth:`@app.route() <Flask.route>` crée une route simple de façon à vous permettre de voir l'application fonctionner avant de faire l'entièreté du tutoriel. Elle relie l'URL ``/hello`` à une fonction qui retourne une réponse, dans ce cas la chaîne de caractères ``'Hello, World!'``.

source: Run The Application
fr: Lancer l'application

source: Now you can run your application using the ``flask`` command. From the terminal, tell Flask where to find your application, then run it in development mode. Remember, you should still be in the top-level ``flask-tutorial`` directory, not the ``flaskr`` package.
fr: Vous pouvez maintenant lancer votre application en utilisant la commande ``flask``. Depuis le terminal, indiquez à Flask où trouver l'application et ensuite lancez-le en mode dévelopemment. N'oubliez pas de vous placer d'abord dans le répertoire ``flask-tutorial`` et non dans le package ``flaskr``.

source: Development mode shows an interactive debugger whenever a page raises an exception, and restarts the server whenever you make changes to the code. You can leave it running and just reload the browser page as you follow the tutorial.
fr: Le mode développement lance automatiquement un débuger interactif lorsqu'une page lance une exception et relance le serveur chaque fois que vous modifiez votre code. Vous pouvez le laisser fonctionner et devez juste recharger la page dans votre navigateur au fur et à mesure de votre progression dans le tutoriel.

source: For Linux and Mac:
fr: Pour Linux et Mac:

source: For Windows cmd, use ``set`` instead of ``export``:
fr: Pour Windows via l'invite de commandes, utilisez ``set`` au lieu de ``export``:

source: For Windows PowerShell, use ``$env:`` instead of ``export``:
fr: Pour Windows Powershell, utilisez ``$env:`` au lieu de ``export``:

source: You'll see output similar to this:
fr: Vous devrie observer une sortie équivalente au texte ci-dessous sur la sortie standard:

source: Visit http://127.0.0.1:5000/hello in a browser and you should see the "Hello, World!" message. Congratulations, you're now running your Flask web application!
fr: Vous pouvez maintenant visiter l'URL http://127.0.0.1:5000/hello dans un navigateur et vous devriez voir le message "Hello, World!". Félicitations, vous exécutez maintenant votre première application web en Flask!

source: Continue to :doc:`database`.
fr: Continuez en lisant le document :doc:`database`.
