Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/install.po
Languages: fr_be

source: Make the Project Installable
fr_be: Rendre le projet installable

source: Making your project installable means that you can build a *distribution* file and install that in another environment, just like you installed Flask in your project's environment. This makes deploying your project the same as installing any other library, so you're using all the standard Python tools to manage everything.
fr_be: Rendre votre projet installable signifie que vous pouvez créer un fichier *distribuable* et l'installer dans un autre environnement, comme vous avez installé Flask dans votre environnement. Cela vous permet de déployer votre projet de la même façon que vous installez n'importe quelle autre librairie en utilisant les outils Python standard pour tout gérer.

source: Installing also comes with other benefits that might not be obvious from the tutorial or as a new Python user, including:
fr_be: L'installation vient avec d'autres bénéfices que ne sont pas immédiatement évidents sur base du tutoriel ou comme utilisateur Python débutant, dont:

source: Currently, Python and Flask understand how to use the ``flaskr`` package only because you're running from your project's directory. Installing means you can import it no matter where you run from.
fr_be: Maintenant, Python et Flask comprennent comment utiliser le package ``flaskr`` uniquement car vous l'exécutez depuis le répertoire de votre projet. L'installation vous permettra de l'importer quelle que soit la façon dont il a été lancé.

source: You can manage your project's dependencies just like other packages do, so ``pip install yourproject.whl`` installs them.
fr_be: Vous pouvez gérer les dépendances de votre projet comme d'autres packages, et donc il vous suffira d'exécuter ``pip install yourproject.whl`` pour les installer.

source: Test tools can isolate your test environment from your development environment.
fr_be: Les outils de test peuvent isoler votre environnement de test de votre environnement de développement.

source: This is being introduced late in the tutorial, but in your future projects you should always start with this.
fr_be: Cette information arrive assez tard dans ce tutoriel, mais dans vos projets futurs vous devriez toujours commencer par cela.

source: Describe the Project
fr_be: Décrivez le projet

source: The ``setup.py`` file describes your project and the files that belong to it.
fr_be: Le fichier ``setup.py`` décrit votre projet et les fichiers qui en font partie.

source: ``packages`` tells Python what package directories (and the Python files they contain) to include. ``find_packages()`` finds these directories automatically so you don't have to type them out. To include other files, such as the static and templates directories, ``include_package_data`` is set. Python needs another file named ``MANIFEST.in`` to tell what this other data is.
fr_be: ``packages`` indique à Python les répertoires contenant les packages (et les fichiers Python qu'ils contiennent) à inclure. ``find_packages()`` trouve ces répertoires automatiquement et donc vous ne devez pas les spécifiez vous-même. Pour inclure d'autres fichiers, comme les répertoires contenant vos fichiers statiques et vos templates, utilisez ``include_packages_data``. Python utilise un autre fichier dénommé ``MANIFEST.in`` pour indiquer ces autres données.

source: This tells Python to copy everything in the ``static`` and ``templates`` directories, and the ``schema.sql`` file, but to exclude all bytecode files.
fr_be: Cela indique à Python de copier tous les fichiers qui se trouvent dans les répertoires ``static`` et ``templates`` ainsi que le fichier ``schema.sql`` mais d'exclure pour les fichiers compilés.

source: See the `official packaging guide`_ for another explanation of the files and options used.
fr_be: Consultez le document `official packaging guide`_ our une autre explication des fichiers et des options utilisés.

source: Install the Project
fr_be: Installer le projet

source: Use ``pip`` to install your project in the virtual environment.
fr_be: Utilisez ``pip`` pour install votre projet dans l'environnement virtuel.

source: This tells pip to find ``setup.py`` in the current directory and install it in *editable* or *development* mode. Editable mode means that as you make changes to your local code, you'll only need to re-install if you change the metadata about the project, such as its dependencies.
fr_be: Ceci indique à pip de chercher ``setup.py`` dans le répertoire courant et de l'installer dans le mode *editable* ou *development*. Le mode *editable* indique que si vous faites des modifications à votre code, vous devrez seulement le réinstaller si vous changez les méta-données du projet comme ses dépendances.

source: You can observe that the project is now installed with ``pip list``.
fr_be: Vous pouvez vérifier que le projet est maintenant installé en tapant ``pip list``.

source: Nothing changes from how you've been running your project so far. ``FLASK_APP`` is still set to ``flaskr`` and ``flask run`` still runs the application, but you can call it from anywhere, not just the ``flask-tutorial`` directory.
fr_be: Rien ne change concernant la façon dont vous avec lancé le projet jusque maintenant. La variable d'environnement ``FLASK_APP`` est toujours mise à ``flaskr`` et ``flask run` lance toujours l'application, mais vous pouvez la lancer depuis n'importe où, pas juste depuis le répertoire ``flask-tutorial``.

source: Continue to :doc:`tests`.
fr_be: Continue vers :doc:`tests`.
