Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/layout.po
Languages: fr

source: Project Layout
fr: Votre projet

source: Create a project directory and enter it:
fr: Créez un répertoire pour votre projet et allez dans ce répertoire:

source: Then follow the :doc:`installation instructions </installation>` to set up a Python virtual environment and install Flask for your project.
fr: Ensuite suivez le document :doc:`installation instructions </installation>` pour créer un environnement virtual Python et installer Flask pour votre projet.

source: The tutorial will assume you're working from the ``flask-tutorial`` directory from now on. The file names at the top of each code block are relative to this directory.
fr: Ce tutorial suppose que vous travaillez depuis un répertoire dénommé ``flask-tutorial``. Les noms de fichiers spécifiés au-dessus de chaque bloc de code sont relatifs à ce répertoire.

source: A Flask application can be as simple as a single file.
fr: Une application Flaks peut être aussi petite qu'un seul fichier.

source: However, as a project gets bigger, it becomes overwhelming to keep all the code in one file. Python projects use *packages* to organize code into multiple modules that can be imported where needed, and the tutorial will do this as well.
fr: Cependant, lorsque le projet grandit, il devient plus difficile de garder l'ensemble du code dans un seul fichier. Les projets Python utilisent la notion de *package* pour organiser le code en différents modules qui peuvent être importés où ils sont nécessaires. Ce tutorial fera de même.

source: The project directory will contain:
fr: Le répertoire du projet contiendra:

source: ``flaskr/``, a Python package containing your application code and files.
fr: ``flaskr/``, un package Python contenant le code de votre application et les fichiers associés.

source: ``tests/``, a directory containing test modules.
fr: ``test/``, un répertoire contenant les modules de test.

source: ``venv/``, a Python virtual environment where Flask and other dependencies are installed.
fr: ``venv/``, un environnement virtuel Python où Flask et d'autres dépendances sont installés.

source: Installation files telling Python how to install your project.
fr: Des fichiers d'installation qui indiquent à Python comment installer votre projet.

source: Version control config, such as `git`_. You should make a habit of using some type of version control for all your projects, no matter the size.
fr: La configuration de votre système de contrôle de version tel que `git`_. Vous devriez prendre l'habitude d'utiliser un système de contrôle de version pour tous vos projets, quelle que soit leur taille.

source: Any other project files you might add in the future.
fr: D'autres fichiers liés au projet que vous pourriez ajouter par après.

source: By the end, your project layout will look like this:
fr: A la fin, votre répertoire de projet devrait ressemble à:

source: If you're using version control, the following files that are generated while running your project should be ignored. There may be other files based on the editor you use. In general, ignore files that you didn't write. For example, with git:
fr: Si vous utilisez un outil de contrôle de version, les fichiers suivants qui sont générés durant l'exécution de votre projet doivent être ignorés. Il peut y avoir d'autres fichiers en fonction de l'éditeur de textes que vous utilisez. En général, ignorez les fichiers que vous n'avez pas écrit vous-même. Par exemple, pour git cela donne:

source: Continue to :doc:`factory`.
fr: Continue en lisant le document :doc:`factory`.
