Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/next.po
Languages: fr

source: Keep Developing!
fr: Continuez à développer!

source: You've learned about quite a few Flask and Python concepts throughout the tutorial. Go back and review the tutorial and compare your code with the steps you took to get there. Compare your project to the :gh:`example project <examples/tutorial>`, which might look a bit different due to the step-by-step nature of the tutorial.
fr: Vous avez appris pas mal de concepts liés à Flask et Python dans ce tutoriel. Retournez au début et comparez votre code avec les étapes qui vous ont amenées ici. Comparez votre projet avec :gh:`example project <examples/tutorial>`, qui pourrait être un peu différent à cause des différentes étapes du tutoriel.

source: There's a lot more to Flask than what you've seen so far. Even so, you're now equipped to start developing your own web applications. Check out the :ref:`quickstart` for an overview of what Flask can do, then dive into the docs to keep learning. Flask uses `Jinja`_, `Click`_, `Werkzeug`_, and `ItsDangerous`_ behind the scenes, and they all have their own documentation too. You'll also be interested in :ref:`extensions` which make tasks like working with the database or validating form data easier and more powerful.
fr: Flask contient plus de fonctionnalités que celles qu'on a pu aborder ici. Cela étant dit, vous êtes maintenant armé pour développer vos propres applications web. Consultez le document :ref:`quickstart` pour un résumé de ce que Flask peut faire et ensuite plongez vous dans la documentation pour continuer à apprendre. Flask s'appuie sur les librairies `Jinja`_, `Click`_, `Werkzeug`_, et `ItsDangerous`_ qui ont aussi leur propre documentation. Vous pourriez aussi être intéressé par les différentes ref:`extensions` qui peuvent vous faciliter des tâches telles qu'accéder à des bases de données ou valider des formulaires plus simplement et plus efficacement.

source: If you want to keep developing your Flaskr project, here are some ideas for what to try next:
fr: Si vous souhaitez continuer à développer votre projet Flaskr, voici quelques suggestions pour de prochaines étapes:

source: A detail view to show a single post. Click a post's title to go to its page.
fr: Une vue détaillée permettant de visualiser un seul message. Cliquez sur le titre d'un message pour visualiser sa page.

source: Like / unlike a post.
fr: Ajouter un bouton `j'aime`/`j'aime pas` sur un message.

source: Comments.
fr: Commentaires.

source: Tags. Clicking a tag shows all the posts with that tag.
fr: Etiquettes. En cliquant sur une étiquette, vous montrez tous les messages avec cette étiquette.

source: A search box that filters the index page by name.
fr: Une boîte de recherche permettant de filtrer la page d'index sur base d'un nom.

source: Paged display. Only show 5 posts per page.
fr: Une visualisation paginée. Montrez uniquement 5 messages par page.

source: Upload an image to go along with a post.
fr: Télécharger une image associée à un message.

source: Format posts using Markdown.
fr: Ecrire les messages en Markdown.

source: An RSS feed of new posts.
fr: Avoir un flux RSS pour les nouveaux messages.

source: Have fun and make awesome applications!
fr: Amusez-vous et créez de superbes applications!
