Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/templates.po
Languages: fr

source: Templates
fr: Modèles (Templates en anglais)

source: You've written the authentication views for your application, but if you're running the server and try to go to any of the URLs, you'll see a ``TemplateNotFound`` error. That's because the views are calling :func:`render_template`, but you haven't written the templates yet. The template files will be stored in the ``templates`` directory inside the ``flaskr`` package.
fr: Vous avez écrit la vue authentification de votre application, mais si vous lancez le serveur et que vous essayez d'aller vers n'importe quel URL, vous verrez une erreur ``TemplateNotFound``. C'est du au fait que les vues appellent la fonction :func:`render_template`, mais vous n'avez pas encore écrit de template (modèle en français). Les fichiers contenant ces templates sont stockés dans le répertoire ``templates`` dans le package ``flaskr``.

source: Templates are files that contain static data as well as placeholders for dynamic data. A template is rendered with specific data to produce a final document. Flask uses the `Jinja`_ template library to render templates.
fr: Les templates sont des fichiers qui contiennent du texte ainsi que des variables qui peuvent être remplacées de façon dynamique. Une template est combinée avec des données pour générer un document final. Flask utilise la librairie `Jinja`° pour convertir ces templates en documents.

source: In your application, you will use templates to render `HTML`_ which will display in the user's browser. In Flask, Jinja is configured to *autoescape* any data that is rendered in HTML templates. This means that it's safe to render user input; any characters they've entered that could mess with the HTML, such as ``<`` and ``>`` will be *escaped* with *safe* values that look the same in the browser but don't cause unwanted effects.
fr: Dans votre application, vous utiliserez des templates pour générer du `HTML`_ qui sera affiché dans le navigateur de l'utilisateur. Avec Flask, Jinja est configuré pour *convertir* (escape en anglais) toute donnée encodée dans les templates HTML. Cela signifie que vous pouvez utiliser sans contrainte les caractères ont un rôle particulier en HTML, dont ``<`` ou ``>`` qui seront automatiquement convertis en valeurs qui donnent le même résultat dans les pages HTML sans effet de bord.

source: Jinja looks and behaves mostly like Python. Special delimiters are used to distinguish Jinja syntax from the static data in the template. Anything between ``{{`` and ``}}`` is an expression that will be output to the final document. ``{%`` and ``%}`` denotes a control flow statement like ``if`` and ``for``. Unlike Python, blocks are denoted by start and end tags rather than indentation since static text within a block could change indentation.
fr: Jinja ressemble à et se comporte comme Python. Des délimiteurs spéciaux sont utilisés pour distinguer la syntaxe Jinja de données statiques dans un template. Tout ce qui se trouve entre ``{`` et ``}}`` est une expression qui sera affichée dans le document final. Les balises ``{%`` et ``%}``dénotent une instruction telle que un ``if`` ou une boucle ``for``. Contrairement à Python, ces blocs sont délimités par des balises ouvrantes et fermantes plutôt que de l'indentation car celle-ci pourrait changer à l'intérieur d'un texte.

source: The Base Layout
fr: La mise en page de base

source: Each page in the application will have the same basic layout around a different body. Instead of writing the entire HTML structure in each template, each template will *extend* a base template and override specific sections.
fr: Chaque page de l'application aura la même mise en page avec un corps spécifique. Plutôt que d'écrire toute la page HTML dans chaque template, nous utiliserons les principes de l'orienté objet et chaque template va *étendre* une template de base et surcharger des sections spécifiques.

source: :data:`g` is automatically available in templates. Based on if ``g.user`` is set (from ``load_logged_in_user``), either the username and a log out link are displayed, or links to register and log in are displayed. :func:`url_for` is also automatically available, and is used to generate URLs to views instead of writing them out manually.
fr: :data:`g` est directement accessible dans les templates. Suivant que ``g.user`` soit initialisé (depuis `load_logged_in_user``), alors soit le nom d'utilisateur et un lien vers la page ``logout`` sont affichés, soit ce sont des liens vers les pages ``register`` et ``login``. La fonction :func:`url_for` est également disponible. Elle est utilisé pour générer les URLs correspondants aux vues plutôt que de les écrire manuellement.

source: After the page title, and before the content, the template loops over each message returned by :func:`get_flashed_messages`. You used :func:`flash` in the views to show error messages, and this is the code that will display them.
fr: Après la page de titre, et juste avant le contenu, le template itère sur chaque message retourné par la fonction :func:`get_flashed_messages`. Vous avez utilisé la conftion :func:`flash` dans les vues pour présenter des messages d'erreur et ceci est le code qui les affiche.

source: There are three blocks defined here that will be overridden in the other templates:
fr: Il y a trois blocs qui sont définis ici et qui seront remplacés dans d'autres templates:

source: ``{% block title %}`` will change the title displayed in the browser's tab and window title.
fr: ``{% block title %}`` change le titre affiché dans l'onglet du navigateur et le titre de la fenêtre.

source: ``{% block header %}`` is similar to ``title`` but will change the title displayed on the page.
fr: ``{% block header %}`` est similaire à ``title``, mais changera le titre affiché sur la page.

source: ``{% block content %}`` is where the content of each page goes, such as the login form or a blog post.
fr: ``{% block content %}` c'est ici que le contenu de chaque page se trouve, comme par exemple le formulaire de login ou un message du blog.

source: The base template is directly in the ``templates`` directory. To keep the others organized, the templates for a blueprint will be placed in a directory with the same name as the blueprint.
fr: Le template de base se trouver dans le répertoire ``templates``. Pour faciliter l'organisation des différents templates, les templates relatives à un plan seront placés dans un répertoire qui a le même nom que le plan.

source: ``{% extends 'base.html' %}`` tells Jinja that this template should replace the blocks from the base template. All the rendered content must appear inside ``{% block %}`` tags that override blocks from the base template.
fr: ``{% extends 'base.html' %}`` indique à Jinja que ce template doit remplacer les blocs du template de base. Tout le contenu produit par le template doit se trouver dans le bloc ``{% block %}`` qui surcharge les blocs du template de base.

source: A useful pattern used here is to place ``{% block title %}`` inside ``{% block header %}``. This will set the title block and then output the value of it into the header block, so that both the window and page share the same title without writing it twice.
fr: Une règle de bonne pratique est d'écrire ``{% block title %}`` à l'intérieur de ``{% block header %}``. Cela permet de fixer le bloc de titre directement dans le bloc header de façon à ce que la fenêtre du navigateur et la page aient le même titre sans devoir l'écrire deux fois.

source: The ``input`` tags are using the ``required`` attribute here. This tells the browser not to submit the form until those fields are filled in. If the user is using an older browser that doesn't support that attribute, or if they are using something besides a browser to make requests, you still want to validate the data in the Flask view. It's important to always fully validate the data on the server, even if the client does some validation as well.
fr: Les balises `'input`` utilisent ici l'attribut ``required``. Cela indique au navigateur de ne pas soumettre le contenu du formulaire tant que ces champs n'ont pas étés remplis. Si l'utilisateur dispose d'un ancien navigateur qui ne supporte pas cet attribut, ou si il utilise une autre logiciel pour réaliser les requêtes, vous devez quand même valider les données dans la vue Flask. Il est important de toujours valider les donnés sur le servuer, même si le client inclus certains fonctions de validation également.

source: This is identical to the register template except for the title and submit button.
fr: Ceci est identique au template register, sauf pour le titre et le bouton ``submit``.

source: Now that the authentication templates are written, you can register a user. Make sure the server is still running (``flask run`` if it's not), then go to http://127.0.0.1:5000/auth/register.
fr: Maintenant que les templates d'authentification ont étés écrits, vous pouvez enregistrer (register en anglais) un utilisateur. Assurez-vous que le serveur fonctionne (lancez ``flask run`` sinon) et ensuit allez à l'URL http://127.0.0.1:5000/auth/register.

source: Try clicking the "Register" button without filling out the form and see that the browser shows an error message. Try removing the ``required`` attributes from the ``register.html`` template and click "Register" again. Instead of the browser showing an error, the page will reload and the error from :func:`flash` in the view will be shown.
fr: Essayez de cliquer sur le bouton "Register" sans remplir le formulaire et vérifiez que celui-ci affiche un message d'erreur. Essayez de retirer l'attribut "required" du template ``register.html`` et cliquez à nouveau sur "Register". Plutôt que d'afficher encore une erreur, la page va se recharger et la fonction :func:`flash` de la vue va être lancée et son résultat affiché.

source: Fill out a username and password and you'll be redirected to the login page. Try entering an incorrect username, or the correct username and incorrect password. If you log in you'll get an error because there's no ``index`` view to redirect to yet.
fr: Entrez un nom d'utilisateur et un mot de passe et vous serez redirigé vers la page login. Essayez d'entrer un nom d'utilisateur incorrect ou un nom correct avec un mauvais mot de passe. Si vous vous connectez (login), vous recevrez un message d'erreur car il n'y a pas encore de vue ``index`` vers laquelle vous rediriger.

source: Continue to :doc:`static`.
fr: Continuez en lisant le document :doc:`static`.
