Repository: obonaventure/flask
Catalog: docs/locale/*/LC_MESSAGES/tutorial/views.po
Languages: fr_be

source: Blueprints and Views
fr_be: Plans et vues

source: A view function is the code you write to respond to requests to your application. Flask uses patterns to match the incoming request URL to the view that should handle it. The view returns data that Flask turns into an outgoing response. Flask can also go the other direction and generate a URL to a view based on its name and arguments.
fr_be: Une fonction "vue" est le code que vous écrivez pour répondre à des requêtes faites à votre application. Flask utilise des patterns pour faire correspondre l'URL d'une requête entrante avec la vue qui doit la traiter. La vue retourne les données que Flask convertit en une réponse. Flask peut aussi travailler dans l'autre sens et générer une URL correspondant à une vue en fonction de son nom et de ses arguments.

source: Create a Blueprint
fr_be: Créer un plan (`blueprint`)

source: A :class:`Blueprint` is a way to organize a group of related views and other code. Rather than registering views and other code directly with an application, they are registered with a blueprint. Then the blueprint is registered with the application when it is available in the factory function.
fr_be: Une classe :class:`Blueprint` est une façon d'organiser un groupe de vues liées et du code associé. Plutôt que d'enregistrer les vues et le code associé directement avec une application, elles sont enregistrées à un plan. Ensuite, le plan est enregistré dans l'application dès qu'il est disponible dans la fonction qui contient l'usine à applications.

source: Flaskr will have two blueprints, one for authentication functions and one for the blog posts functions. The code for each blueprint will go in a separate module. Since the blog needs to know about authentication, you'll write the authentication one first.
fr_be: Flaskr contiendra deux plans, un pour les fonctions d'authentification et l'autre pour les fonctions liées aux posts sur le blog. Le code pour chaque plan sera placé dans un module séparé. Puisque le blog nécessite une authentification, vous allez d'abord écrire le plan qui y est relatif.

source: This creates a :class:`Blueprint` named ``'auth'``. Like the application object, the blueprint needs to know where it's defined, so ``__name__`` is passed as the second argument. The ``url_prefix`` will be prepended to all the URLs associated with the blueprint.
fr_be: Ceci créée une classe :class:'Blueprint` dénommée ` 'auth'``. Comme l'objet application, le plan doit connaître l'endroit où il a été défini. C'est pour cela que ``__name__`` est passé comme deuxième argument. L``url_prefix`` est ajouté au début de tous les URLs associés à ce plan.

source: Import and register the blueprint from the factory using :meth:`app.register_blueprint() <Flask.register_blueprint>`. Place the new code at the end of the factory function before returning the app.
fr_be: Importez and enregistrez le plan depuis l'usine à applications en utilisant :meth:`app.register_blueprint() <Flask.register_blueprint>`. Placez ensuite le nouveau code à la fin de la fonction usine à applications avant de retourner l'application.

source: The authentication blueprint will have views to register new users and to log in and log out.
fr_be: Le plan authentification devra avoir des vues permettant d'enregistrer de nouveaux utilisateurs ainsi que de se connecter et déconnecter.

source: The First View: Register
fr_be: La première vue: Register

source: When the user visits the ``/auth/register`` URL, the ``register`` view will return `HTML`_ with a form for them to fill out. When they submit the form, it will validate their input and either show the form again with an error message or create the new user and go to the login page.
fr_be: Lorsque l'utilisateur visite l'URL ``/auth/register``, la vue ``register`` va retourner du `HTML`_ contenant un formulaire à remplir. Lorsque l'utilisateur soumet le formulaire, son contenu est validé et soit celui-ci est réaffiché avec un message d'erreur ou le nouvel utilisateur est créé et l'on renvoie vers la page de login.

source: For now you will just write the view code. On the next page, you'll write templates to generate the HTML form.
fr_be: Pour le moment, vous allez uniquement écrire le code relatif à la vue. Vous verrez sur les page suivante comment utiliser des templates pour générer le formulaire HTML.

source: Here's what the ``register`` view function is doing:
fr_be: Voici ce que la fonction ``register`` fait:

source: :meth:`@bp.route <Blueprint.route>` associates the URL ``/register`` with the ``register`` view function. When Flask receives a request to ``/auth/register``, it will call the ``register`` view and use the return value as the response.
fr_be: :meth:`@bp.route <Blueprint.route>` associe l'URL ``/register`` avec la fonction de vue ``register``. Lorsque Flask reçoit une requête vers l'URL ``/auth/register``, elle appelle la vue ``register`` et génère sa réponse sur base de la valeur de retour.

source: If the user submitted the form, :attr:`request.method <Request.method>` will be ``'POST'``. In this case, start validating the input.
fr_be: Si l'utilisateur a soumis un formulaire, :attr:`request.method <Request.method>` aura comme valeur ``'POST'``. Dans ce cas, il faut valider l'information encodée par l'utilisateur.

source: :attr:`request.form <Request.form>` is a special type of :class:`dict` mapping submitted form keys and values. The user will input their ``username`` and ``password``.
fr_be: :attr:`request.form <Request.form>` est un type spécial de :class:`dict` qui met en correspondance les clés et valeurs du formulaire. L'utilisateur fournit les valeurs pour les clés ``username`` et ``password``.

source: Validate that ``username`` and ``password`` are not empty.
fr_be: Vérifier que les valeurs des champs ``username`` et ``password`` ne sont pas vides.

source: :meth:`~sqlite3.Cursor.fetchone` returns one row from the query. If the query returned no results, it returns ``None``. Later, :meth:`~sqlite3.Cursor.fetchall` is used, which returns a list of all results.
fr_be: :meth:`~sqlite3.Cursor.fetchone` retourne une ligne de la requête. Si la requếte n'a pas retourné de résultat, elle retourne ``None``. Ensuite, la fonction :meth:`~sqlite3.Cursor.fetchall`, qui elle retourne une liste avec tous les résultats, sera utilisée.

source: If validation succeeds, insert the new user data into the database. For security, passwords should never be stored in the database directly. Instead, :func:`~werkzeug.security.generate_password_hash` is used to securely hash the password, and that hash is stored. Since this query modifies data, :meth:`db.commit() <sqlite3.Connection.commit>` needs to be called afterwards to save the changes.
fr_be: Si la vérification réussit, l'information relative au nouveau utilisateur est ajoutée à la base de données. Pour des raisons de sécurité, les mots de passe ne doivent *jamais* être stockés `en clair`dans la base de données. La fonction :func:`~werkzeug.security.generate_password_hash` est utilisée pour calculer un hash du mot de passe et c'est ce hash qui est stocké. Comme cette requête modifie des données, il ne faut pas oublier d'appeler :meth:`db.commit() <sqlite3.Connection.commit>` pour sauver les modifications.

source: After storing the user, they are redirected to the login page. :func:`url_for` generates the URL for the login view based on its name. This is preferable to writing the URL directly as it allows you to change the URL later without changing all code that links to it. :func:`redirect` generates a redirect response to the generated URL.
fr_be: Après avoir stocké l'information relative à l'utilisateur, celui-ci est redirigé vers la page de login. La fonction :func:`url_for` génère l'URL de la vue de login sur base du nom. Ceci est préférable à une écriture directe de l'URL car cela vous permettra de changer l'URL ultérieurement sans devoir changer tout le code qui y est lié. :func:`redirect` génère une réponse de redirection pour l'URL généré.

source: When the user initially navigates to ``auth/register``, or there was a validation error, an HTML page with the registration form should be shown. :func:`render_template` will render a template containing the HTML, which you'll write in the next step of the tutorial.
fr_be: Lorsque l'utilisateur clique initialement sur ``auth/register``, ou si il y a une erreur de validation, une page HTML contenant le formulaire d'enregistrement doit être présentée. La fonction :func:`render_template` va générer un template contenant le HTML, que vous écrirez dans la prochain section du tutoriel.

source: This view follows the same pattern as the ``register`` view above.
fr_be: Cette vue s'organise de façon similaire à la vue ``register`` ci-dessus.

source: There are a few differences from the ``register`` view:
fr_be: Il y a cependant quelques différences par rapport à la vue ``register``:

source: The user is queried first and stored in a variable for later use.
fr_be: On recherche d'abord l'utilisateur (`user`) et sa valeur est stockée dans une variable pour être réutilisée après.

source: :func:`~werkzeug.security.check_password_hash` hashes the submitted password in the same way as the stored hash and securely compares them. If they match, the password is valid.
fr_be: la fonction :func:`~werkzeug.security.check_password_hash` calcule un hash du mot de passe soumis de la même façon que le hash stocké et compare les deux de façon sûre. Si ils correspondent, le mot de passe est considéré comme valide.

source: :data:`session` is a :class:`dict` that stores data across requests. When validation succeeds, the user's ``id`` is stored in a new session. The data is stored in a *cookie* that is sent to the browser, and the browser then sends it back with subsequent requests. Flask securely *signs* the data so that it can't be tampered with.
fr_be: :data:`session` est un :class:`dict` qui stocke des données d'une requête à l'autre. Si la validation du mot de passe réussit, l'``id`` de l'utilisateur est stocké dans une session. La donnée est stockée dans un *cookie* qui est envoyé au navigateur. Celui-ci le renverra pour les requêtes suivantes. Flask *signe* cette donnée de façon sûre afin de garantir qu'elle n'a pas été modifiée par un pirate.

source: Now that the user's ``id`` is stored in the :data:`session`, it will be available on subsequent requests. At the beginning of each request, if a user is logged in their information should be loaded and made available to other views.
fr_be: Maintenant que l'``id`` de l'utilisateur est stocké dans la :data:`session, celui-ci sera disponible pour les requêtes suivantes. A début de chaque requête, l'application vérifiera si l'utilisateur est authentifié et si c'est le l'information correspondante sera chargée et mise à disposition des autres vues.

source: :meth:`bp.before_app_request() <Blueprint.before_app_request>` registers a function that runs before the view function, no matter what URL is requested. ``load_logged_in_user`` checks if a user id is stored in the :data:`session` and gets that user's data from the database, storing it on :data:`g.user <g>`, which lasts for the length of the request. If there is no user id, or if the id doesn't exist, ``g.user`` will be ``None``.
fr_be: :meth:`bp.before_app_request() <Blueprint.before_app_request>` enregistre une fonction qui s'exécute avant la fonction "vue", quelle que soit l'URL demandée. ``load_logged_in_user`` vérifie si l'``id`` de l'utilisateur est stocké dans la :data:`session` et récupère son information dans la base de données et la stocke dans :data`g.user <g>` qui persiste pendant la durée de la requête. Si il n'y a pas d'``id`` d'utilisateur ou si cet ``id`` n'existe pas, ``g.user`` est mis à la valeur ``None``.

source: To log out, you need to remove the user id from the :data:`session`. Then ``load_logged_in_user`` won't load a user on subsequent requests.
fr_be: Pour terminer la connexion, il suffit de retirer l'``id`` de l'utilisateur de la :data:`session`. De cette façon, ``load_logged_in_user`` ne chargera pas les informations relatives à l'utilisateur lors de prochaines requêtes.

source: Require Authentication in Other Views
fr_be: Besoins d'authentification dans d'autres vues

source: Creating, editing, and deleting blog posts will require a user to be logged in. A *decorator* can be used to check this for each view it's applied to.
fr_be: L'utilisateur doit être authentifié pour pouvoir créer, éditer ou effacer des messages de blog. Un *décorateur* peut être utilisé pour vérifier cela pour chaque vue à laquelle il s'applique.

source: This decorator returns a new view function that wraps the original view it's applied to. The new function checks if a user is loaded and redirects to the login page otherwise. If a user is loaded the original view is called and continues normally. You'll use this decorator when writing the blog views.
fr_be: Ce décorateur retourne une nouvelle fonction vue qui englobe la vue originale à laquelle elle est appliquée. Cette nouvelle fonction vérifie si un utilisateur est chargé et sinon redirige vers la page de login. Si un utilisateur est chargé, la vue orginale est appelée et son traitement continue normalement. Vous utiliserez ce décorateur lorsque vous écrirez les vues du blog.

source: The :func:`url_for` function generates the URL to a view based on a name and arguments. The name associated with a view is also called the *endpoint*, and by default it's the same as the name of the view function.
fr_be: La fonction :func:`url_for` génère l'URL associé à une vue sur base d'un nom et d'arguments. Le nom associé à une vue est aussi appelé le point final (*endpoint* en anglais). Par défaut, il est identique au nom de la fonction vue.

source: For example, the ``hello()`` view that was added to the app factory earlier in the tutorial has the name ``'hello'`` and can be linked to with ``url_for('hello')``. If it took an argument, which you'll see later, it would be linked to using ``url_for('hello', who='World')``.
fr_be: Par exemple, la vue ``hello()`` wui a été ajoutée précédemment à l'usine à applications a comme nom ``hello`` et peut être associée avec ``url_for('hello')``. Si elle avait pris un argument, ce que vous verrez par après, elle aurait été associée en utilisant `url_for('hello', who='World')``.

source: When using a blueprint, the name of the blueprint is prepended to the name of the function, so the endpoint for the ``login`` function you wrote above is ``'auth.login'`` because you added it to the ``'auth'`` blueprint.
fr_be: En utilisant un plan, le nom du plan est préfixé au nom de la fonction. Pour cette raison, le point final de la fonction ``login`` qui vous avez écrite précédemment est ``auth.login`` puisque vous l'avez ajoutée au plan ``'auth'``.

source: Continue to :doc:`templates`.
fr_be: Continuez en lisant le document :doc:`templates`.
